In [1]:
# Import libraries

import pandas as pd

In [2]:
df = pd.read_csv("adult.data.csv")
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [6]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
age,32561.0,38.581647,13.640433,17.0,28.0,37.0,48.0,90.0
fnlwgt,32561.0,189778.366512,105549.977697,12285.0,117827.0,178356.0,237051.0,1484705.0
education-num,32561.0,10.080679,2.572720,1.0,9.0,10.0,12.0,16.0
capital-gain,32561.0,1077.648844,7385.292085,0.0,0.0,0.0,0.0,99999.0
capital-loss,32561.0,87.303830,402.960219,0.0,0.0,0.0,0.0,4356.0
hours-per-week,32561.0,40.437456,12.347429,1.0,40.0,40.0,45.0,99.0

# Questin 1

How many people of each race are represented in this dataset? 
This should be a Pandas series with race names as the index labels. 
(`race` column)

In [22]:
race = df['race'].value_counts()

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

# Qustion 2
What is the average age of men?

In [41]:
men_data = df[df['sex'] == 'Male']
round(men_data['age'].mean())

39

# Question 3
What is the percentage of people who have a Bachelor's degree?

In [57]:
edu_percent = pd.DataFrame(df['education'].sort_values().value_counts())
edu_percent['percentage'] = edu_percent['education']/edu_percent['education'].sum()
bach = edu_percent['percentage'].loc['Bachelors']
bach

0.16446055096587942

# Question 4

What percentage of people with advanced education 
(`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?

In [70]:
edu_percent_a = df[['education', 'salary']]
# edu_percent_a = edu_percent_a[edu_percent_a['salary'] == '>50K']
edu_percent_a

        education salary
0       Bachelors  <=50K
1       Bachelors  <=50K
2         HS-grad  <=50K
3            11th  <=50K
4       Bachelors  <=50K
...           ...    ...
32556  Assoc-acdm  <=50K
32557     HS-grad   >50K
32558     HS-grad  <=50K
32559     HS-grad  <=50K
32560     HS-grad   >50K

[32561 rows x 2 columns]